cctv180/STM32H743XI_Demo/User/bsp/src/bsp_uart.c
/*
*********************************************************************************************************
*
*   模块名称 : 串口中断+FIFO驱动模块
*   文件名称 : bsp_uart_fifo.c
*   版    本 : V1.8
*   说    明 : 采用串口中断+FIFO模式实现多个串口的同时访问
*   修改记录 :
*       版本号  日期       作者    说明
*       V1.0    2013-02-01 armfly  正式发布
*       V1.1    2013-06-09 armfly  FiFo结构增加TxCount成员变量，方便判断缓冲区满; 增加 清FiFo的函数
*       V1.2    2014-09-29 armfly  增加RS485 MODBUS接口。接收到新字节后，直接执行回调函数。
*       V1.3    2015-07-23 armfly  增加 UART_T 结构的读写指针几个成员变量必须增加 __IO 修饰,否则优化后
*                   会导致串口发送函数死机。
*       V1.4    2015-08-04 armfly  解决UART4配置bug  GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_USART1);
*       V1.5    2015-10-08 armfly  增加修改波特率的接口函数
*       V1.6    2018-09-07 armfly  移植到STM32H7平台
*       V1.7    2018-10-01 armfly  增加 Sending 标志，表示正在发送中
*       V1.8    2018-11-26 armfly  增加UART8，第8个串口
*
*   Copyright (C), 2015-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include "bsp.h"
#include "bsp_uart.h"
#include "ring_buffer.h"

/* Private variables ---------------------------------------------------------*/

/* External variables --------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/
#define LPUART_BRR_MIN 0x00000300U /* LPUART BRR minimum authorized value */
#define LPUART_BRR_MAX 0x000FFFFFU /* LPUART BRR maximum authorized value */

#define UART_BRR_MIN 0x10U       /* UART BRR minimum authorized value */
#define UART_BRR_MAX 0x0000FFFFU /* UART BRR maximum authorized value */

static void UartVarInit(void);
static UART_T *ComToUart(COM_PORT_E _ucPort);
static UART_T *BaseToUart(USART_TypeDef *_pBase);
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen);

static void RS485_InitTXE(void);            /* 配置RS485发送使能GPIO */
static void RS485_SendBefor(void);          /* 串口发送前 */
static void RS485_SendOver(void);           /* 串口发送后 */
static void RS485_ReciveNew(uint8_t _byte); /* 串口收到新数据 */

#if UART1_FIFO_EN == 1
UART_T g_tUart1 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf1[UART1_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf1[UART1_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;
DMA_HandleTypeDef hdma_usart1_rx;
#endif

#if UART2_FIFO_EN == 1
UART_T g_tUart2 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf2[UART2_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf2[UART2_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_tx;
DMA_HandleTypeDef hdma_usart2_rx;
#endif

#if UART3_FIFO_EN == 1
UART_T g_tUart3 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf3[UART3_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf3[UART3_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart3_tx;
DMA_HandleTypeDef hdma_usart3_rx;
#endif

#if UART4_FIFO_EN == 1
UART_T g_tUart4 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf4[UART4_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf4[UART4_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart4;
DMA_HandleTypeDef hdma_usart4_tx;
DMA_HandleTypeDef hdma_usart4_rx;
#endif

#if UART5_FIFO_EN == 1
UART_T g_tUart5 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf5[UART5_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf5[UART5_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart5;
DMA_HandleTypeDef hdma_usart5_tx;
DMA_HandleTypeDef hdma_usart5_rx;
#endif

#if UART6_FIFO_EN == 1
UART_T g_tUart6 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf6[UART6_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf6[UART6_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_usart6_tx;
DMA_HandleTypeDef hdma_usart6_rx;
#endif

#if UART7_FIFO_EN == 1
UART_T g_tUart7 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf7[UART7_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf7[UART7_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart7;
DMA_HandleTypeDef hdma_usart7_tx;
DMA_HandleTypeDef hdma_usart7_rx;
#endif

#if UART8_FIFO_EN == 1
UART_T g_tUart8 = {0};
__attribute__((aligned(32))) uint8_t s_tx_buf8[UART8_TX_BUF_SIZE]; /* 发送缓冲区 */
__attribute__((aligned(32))) uint8_t s_rx_buf8[UART8_RX_BUF_SIZE]; /* 接收缓冲区 */
UART_HandleTypeDef huart8;
DMA_HandleTypeDef hdma_usart8_tx;
DMA_HandleTypeDef hdma_usart8_rx;
#endif

/**
 * @brief USART1 Initialization Function
 * @param None
 * @retval None
 */
#if UART1_FIFO_EN == 1
static void MX_USART1_UART_Init(void)
{
    huart1.Instance = USART1;
    huart1.Init.BaudRate = 115200;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart1.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(&huart1) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_SetTxFifoThreshold(&huart1, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_SetRxFifoThreshold(&huart1, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_DisableFifoMode(&huart1) != HAL_OK)
    {
        ERROR_HANDLER();
    }
}
#endif

/**
 * @brief USART3 Initialization Function
 * @param None
 * @retval None
 */
#if UART3_FIFO_EN == 1
static void MX_USART3_UART_Init(void)
{
    huart3.Instance = USART3;
    huart3.Init.BaudRate = 115200;
    huart3.Init.WordLength = UART_WORDLENGTH_8B;
    huart3.Init.StopBits = UART_STOPBITS_1;
    huart3.Init.Parity = UART_PARITY_NONE;
    huart3.Init.Mode = UART_MODE_TX_RX;
    huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart3.Init.OverSampling = UART_OVERSAMPLING_16;
    huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart3.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(&huart3) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_SetTxFifoThreshold(&huart3, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_SetRxFifoThreshold(&huart3, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_DisableFifoMode(&huart3) != HAL_OK)
    {
        ERROR_HANDLER();
    }
}
#endif

/**
 * @brief USART6 Initialization Function
 * @param None
 * @retval None
 */
#if UART6_FIFO_EN == 1
static void MX_USART6_UART_Init(void)
{
    huart6.Instance = USART6;
    huart6.Init.BaudRate = 115200;
    huart6.Init.WordLength = UART_WORDLENGTH_8B;
    huart6.Init.StopBits = UART_STOPBITS_1;
    huart6.Init.Parity = UART_PARITY_NONE;
    huart6.Init.Mode = UART_MODE_TX_RX;
    huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart6.Init.OverSampling = UART_OVERSAMPLING_16;
    huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart6.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(&huart6) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_SetTxFifoThreshold(&huart6, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_SetRxFifoThreshold(&huart6, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
    {
        ERROR_HANDLER();
    }
    if (HAL_UARTEx_DisableFifoMode(&huart6) != HAL_OK)
    {
        ERROR_HANDLER();
    }
}
#endif

/**
 * @brief UART MSP Initialization
 * This function configures the hardware resources used in this example
 * @param huart: UART handle pointer
 * @retval None
 */
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
    if (huart->Instance == USART1)
    {
#if UART1_FIFO_EN == 1
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART1;
        PeriphClkInitStruct.Usart16ClockSelection = RCC_USART16CLKSOURCE_D2PCLK2;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
        {
            ERROR_HANDLER();
        }

        /* Peripheral clock enable */
        __HAL_RCC_USART1_CLK_ENABLE();

        __HAL_RCC_GPIOA_CLK_ENABLE();
        /**USART1 GPIO Configuration
        PA10     ------> USART1_RX
        PA9     ------> USART1_TX
        */
        GPIO_InitStruct.Pin = GPIO_PIN_10 | GPIO_PIN_9;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        /* USART1 DMA Init */
        /* USART1_RX Init */
        hdma_usart1_rx.Instance = DMA1_Stream0;
        hdma_usart1_rx.Init.Request = DMA_REQUEST_USART1_RX;
        hdma_usart1_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
        hdma_usart1_rx.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_usart1_rx.Init.MemInc = DMA_MINC_ENABLE;
        hdma_usart1_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        hdma_usart1_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        hdma_usart1_rx.Init.Mode = DMA_CIRCULAR;
        hdma_usart1_rx.Init.Priority = DMA_PRIORITY_LOW;
        hdma_usart1_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        if (HAL_DMA_Init(&hdma_usart1_rx) != HAL_OK)
        {
            ERROR_HANDLER();
        }

        __HAL_LINKDMA(huart, hdmarx, hdma_usart1_rx);

        /* USART1_TX Init */
        hdma_usart1_tx.Instance = DMA1_Stream1;
        hdma_usart1_tx.Init.Request = DMA_REQUEST_USART1_TX;
        hdma_usart1_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
        hdma_usart1_tx.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_usart1_tx.Init.MemInc = DMA_MINC_ENABLE;
        hdma_usart1_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        hdma_usart1_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        hdma_usart1_tx.Init.Mode = DMA_NORMAL;
        hdma_usart1_tx.Init.Priority = DMA_PRIORITY_LOW;
        hdma_usart1_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        if (HAL_DMA_Init(&hdma_usart1_tx) != HAL_OK)
        {
            ERROR_HANDLER();
        }

