cctv180/STM32H743XI_Demo/User/bsp/src/bsp_uart.c
                // printf("COM Select Error(Range 1 - 8).\r\n");
                printf("COM Select Error(Range");
                for (uint8_t i = 0; i <= 8; i++)
                {
                    if ((ComToUart(i)) != 0)
                    {
                        printf(" %d", i);
                    }
                }
                printf(").\r\n");
            }
        }
        else if (!strcmp(operator, "read"))
        {
            if (argc >= 2 && !strcmp(argv[2], "len"))
            {
                length = comGetLen((COM_PORT_E)com_num);
                printf("length = %d\r\n", length);
            }
            else if (argc >= 2 && !strcmp(argv[2], "char"))
            {

                if (comGetChar((COM_PORT_E)com_num, &data))
                {
                    printf("read char = 0x%02X(%c)\r\n", data, data);
                }
                else
                {
                    printf("read char NULL\r\n");
                }
            }
            else if (argc >= 2 && !strcmp(argv[2], "buff"))
            {
                if (argc >= 4)
                {

                    length = atoi(argv[3]);
                    buff = malloc(length);
                    if (buff)
                    {
                        size = comGetBuf((COM_PORT_E)com_num, buff, length);

                        printf("Read buff success. size = %d. The data is:\r\n", size);
                        printf("Offset (h) 00 01 02 03 04 05 06 07 08 09 0A 0B 0C 0D 0E 0F\r\n");
                        for (i = 0; i < size; i += HEXDUMP_WIDTH)
                        {
                            printf("[%08X] ", i);
                            /* dump hex */
                            for (j = 0; j < HEXDUMP_WIDTH; j++)
                            {
                                if (i + j < size)
                                {
                                    printf("%02X ", buff[i + j]);
                                }
                                else
                                {
                                    printf("   ");
                                }
                            }
                            /* dump char for hex */
                            for (j = 0; j < HEXDUMP_WIDTH; j++)
                            {
                                if (i + j < size)
                                {
                                    printf("%c", __is_print(buff[i + j]) ? buff[i + j] : '.');
                                }
                            }
                            printf("\r\n");
                        }
                        printf("\r\n");
                    }
                    else
                    {
                        printf("Low memory!\r\n");
                    }
                }
                else
                {
                    printf("read parameter Error.\r\ncom buff [len]\r\n");
                }
            }
            else
            {
                printf("read parameter Error.\r\ncom read [len | char | buff]\r\n");
                result = -1;
            }
            printf("Select COM%d Read\r\n", com_num);
        }
        else if (!strcmp(operator, "write"))
        {
            if (argc >= 3)
            {
                comSendBuf((COM_PORT_E)com_num, (uint8_t *)argv[2], strlen(argv[2]));
            }
            else
            {
                printf("read parameter Error.\r\ncom write ...\r\n");
                result = -1;
            }
        }
        else if (!strcmp(operator, "clear"))
        {
            comClearRxFifo((COM_PORT_E)com_num);
            comClearTxFifo((COM_PORT_E)com_num);
        }
        else if (!strcmp(operator, "baud"))
        {
            uint32_t baud;
            if (argc >= 3)
            {
                baud = strtol(argv[2], NULL, 0);
                if (baud)
                {
                    return comSetBaud((COM_PORT_E)com_num, baud);
                }
                else
                {
                    printf("com baud error = 0\r\n");
                }
            }
            else
            {
                printf("read parameter Error.\r\ncom baud xx\r\n");
                result = -1;
            }
        }
    }

    if (buff != NULL)
    {
        free(buff);
    }
    return result;
}
// 导出到命令列表里
SHELL_EXPORT_CMD(SHELL_CMD_PERMISSION(0) | SHELL_CMD_TYPE(SHELL_TYPE_CMD_MAIN), com, com_uart, com find[dev | part]);
#endif // #ifdef DEBUG_MODE

/*
*********************************************************************************************************
*   函 数 名: fputc
*   功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
int fputc(int ch, FILE *f)
{
#if 1 /* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
    comSendChar(COM1, ch);

    return ch;
#else /* 采用阻塞方式发送每个字符,等待数据发送完毕 */
    /* 写一个字节到USART1 */
    USART6->TDR = ch;

    /* 等待发送结束 */
    while ((USART6->ISR & USART_ISR_TC) == 0)
    {
    }

    return ch;
#endif
}

/*
*********************************************************************************************************
*   函 数 名: fgetc
*   功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{

#if 1 /* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
    uint8_t ucData;

    while (comGetChar(COM1, &ucData) == 0)
        ;

    return ucData;
#else
    /* 等待接收到数据 */
    while ((USART1->ISR & USART_ISR_RXNE) == 0)
    {
    }

    return (int)USART1->RDR;
#endif
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
